#include "launcher.h"
#include "elf_abi.h"
#include "../src/common/common.h"
#include "../../libwiiu/src/coreinit.h"
#include "../../libwiiu/src/vpad.h"
#include "../../libwiiu/src/socket.h"

#if VER == 532
    #define CODE_RW_BASE_OFFSET     0xBC000000
    #define DATA_RW_BASE_OFFSET     0

    // Function definitions
    #define SYSLaunchMiiStudio ((void (*)(void))0xDEAAEB8)
    #define _Exit ((void (*)(void))0x0101cd70)
    #define OSEffectiveToPhysical ((void* (*)(const void*))0x0101f510)
    #define memcpy ((void * (*)(void * dest, const void * src, int num))0x1035a6c)
    #define DCFlushRange ((void (*)(const void *addr, uint length))0x1023ee8)
    #define ICInvalidateRange ((void (*)(const void *addr, uint length))0x1024010)
#endif

#define PRINT_TEXT1(x, y, str) { OSScreenPutFontEx(1, x, y, str); }
#define PRINT_TEXT2(x, y, _fmt, ...) { __os_snprintf(msg, 80, _fmt, __VA_ARGS__); OSScreenPutFontEx(1, x, y, msg); }
#define BTN_PRESSED (BUTTON_LEFT | BUTTON_RIGHT | BUTTON_UP | BUTTON_DOWN)


typedef union u_serv_ip
{
    uint8_t  digit[4];
    uint32_t full;
} u_serv_ip;

typedef struct {
    char tag[8];                     /* 0x000 "OSContxt" */
    int32_t gpr[32];                 /* 0x008 from OSDumpContext */
    uint32_t cr;                     /* 0x088 from OSDumpContext */
    uint32_t lr;                     /* 0x08c from OSDumpContext */
    uint32_t ctr;                    /* 0x090 from context switch code */
    uint32_t xer;                    /* 0x094 from context switch code */
    uint32_t srr0;                   /* 0x098 from OSDumpContext */
    uint32_t srr1;                   /* 0x09c from OSDumpContext */
    char _unknowna0[0xb8 - 0xa0];
    uint64_t fpr[32];                /* 0x0b8 from OSDumpContext */
    int16_t spinLockCount;           /* 0x1b8 from OSDumpContext */
    char _unknown1ba[0x1bc - 0x1ba]; /* 0x1ba could genuinely be padding? */
    uint32_t gqr[8];                 /* 0x1bc from OSDumpContext */
    char _unknown1dc[0x1e0 - 0x1dc];
    uint64_t psf[32];                /* 0x1e0 from OSDumpContext */
    int64_t coretime[3];             /* 0x2e0 from OSDumpContext */
    int64_t starttime;               /* 0x2f8 from OSDumpContext */
    int32_t error;                   /* 0x300 from OSDumpContext */
    char _unknown304[0x6a0 - 0x304];
} __attribute__((packed)) OSThread;  /* 0x6a0 total length from RAM dumps */

typedef struct {
    unsigned char *data;
    int len;
    int alloc_size;

    void*(*MEMAllocFromDefaultHeapEx)(unsigned int size, unsigned int align);
    void(*MEMFreeToDefaultHeap)(void *ptr);
} file_struct_t;

typedef struct {
    unsigned char *data_elf;
    unsigned int coreinit_handle;
    /* function pointers */
    void*(*memset)(void * dest, unsigned int value, unsigned int bytes);

    void*(*MEMAllocFromDefaultHeapEx)(unsigned int size, unsigned int align);
    void(*MEMFreeToDefaultHeap)(void *ptr);

    void*(*curl_easy_init)();
    void(*curl_easy_setopt)(void *handle, unsigned int param, void *op);
    int(*curl_easy_perform)(void *handle);
    void(*curl_easy_getinfo)(void *handle, unsigned int param, void *op);
    void (*curl_easy_cleanup)(void *handle);
} private_data_t;

